---
kind: other
id: Methods.T:Autodesk.Revit.DB.InternalOrigin
source: html/f989704a-e608-7de1-a9d1-666406c0e47d.htm
---
# InternalOrigin Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.